; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph0 - mode
	thermograph3 - mode
	spectrograph4 - mode
	image1 - mode
	infrared5 - mode
	infrared2 - mode
	Star0 - direction
	Phenomenon1 - direction
	Phenomenon2 - direction
	Star3 - direction
	Phenomenon4 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 thermograph0)
	(supports instrument0 infrared2)
	(supports instrument0 infrared5)
	(supports instrument0 image1)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
)
(:goal (and
	(pointing satellite0 Phenomenon1)
	(have_image Phenomenon1 infrared2)
	(have_image Phenomenon2 image1)
	(have_image Phenomenon2 thermograph0)
	(have_image Star3 infrared5)
	(have_image Star3 infrared2)
	(have_image Phenomenon4 image1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 7
3. (turn_to satellite0 phenomenon1 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon1)
   goals met: 1 of 7
4. (take_image satellite0 phenomenon1 instrument0 infrared2)
   added: (have_image phenomenon1 infrared2)
   goals met: 2 of 7
5. (turn_to satellite0 phenomenon2 phenomenon1)
   deleted: (pointing satellite0 phenomenon1)
   added: (pointing satellite0 phenomenon2)
   goals met: 1 of 7
6. (take_image satellite0 phenomenon2 instrument0 image1)
   added: (have_image phenomenon2 image1)
   goals met: 2 of 7
7. (take_image satellite0 phenomenon2 instrument0 thermograph0)
   added: (have_image phenomenon2 thermograph0)
   goals met: 3 of 7
8. (turn_to satellite0 phenomenon1 phenomenon2)
   deleted: (pointing satellite0 phenomenon2)
   added: (pointing satellite0 phenomenon1)
   goals met: 4 of 7
9. (turn_to satellite0 phenomenon4 phenomenon1)
   deleted: (pointing satellite0 phenomenon1)
   added: (pointing satellite0 phenomenon4)
   goals met: 3 of 7
10. (take_image satellite0 phenomenon4 instrument0 image1)
   added: (have_image phenomenon4 image1)
   goals met: 4 of 7
11. (turn_to satellite0 phenomenon1 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 phenomenon1)
   goals met: 5 of 7
12. (turn_to satellite0 star3 phenomenon1)
   deleted: (pointing satellite0 phenomenon1)
   added: (pointing satellite0 star3)
   goals met: 4 of 7
13. (take_image satellite0 star3 instrument0 infrared2)
   added: (have_image star3 infrared2)
   goals met: 5 of 7
14. (take_image satellite0 star3 instrument0 infrared5)
   added: (have_image star3 infrared5)
   goals met: 6 of 7
15. (turn_to satellite0 phenomenon1 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon1)
   goals met: 7 of 7
